spec/fixtures/subscription_response.json

{
  "id":"74FCA99C15574083AA0E9F400148A68C",
 "suspended":"false",
 "plan_identifier":"meu-slug",
 "price_cents":1000,
 "currency":"BRL",
 "features":{},
 "expires_at":"2016-08-18",
 "created_at":"2016-07-18T17:42:40-03:00",
 "updated_at":"2016-07-18T17:42:42-03:00",
 "customer_name":"Me Salva!",
 "customer_email":"person1@mesalva.com",
 "cycled_at":"nil",
 "credits_min":0,
 "credits_cycle":"nil",
 "payable_with":"all",
 "customer_id":"C9D0A8F68F7F415A87CDC55EC11A7242",
 "plan_name":"other package name",
 "customer_ref":"Me Salva!",
 "plan_ref":"other package name",
 "active":"true",
 "in_trial":"nil",
 "credits":0,
 "credits_based":"false",
 "recent_invoices":
  [{"id":"D9D0A8F68F7F415A87CDC55EC11A7242",
    "due_date":"2016-07-18",
    "status":"paid",
    "total":"R$ 10,00",
    "secure_url":"https://iugu.com/invoices/0efd811b-556c-4a0b-bdad-fba70ba42dfd-da58"}],
 "subitems":[],
 "logs":
  [{"id":"441556939E23459DA83744642D04D477",
    "description":"Fatura criada",
    "notes":"Fatura criada com os items:  1x Ativação de Assinatura: other package name = R$ 10,00;",
    "created_at":"2016-07-18T17:42:41-03:00"},
   {"id":"36A5F3B17DBD4319BC56D223F7E12581", "description":"Assinatura Criada", "notes":"Assinatura Criada ", "created_at":"2016-07-18T17:42:40-03:00"}],
 "custom_variables":[]}
